{
    "name": "Game Agent",

    "system": [
        "You are a game master.\n\n",
        "The goal of the game is for the player to find an old airship captain in a busy Steampunk Town and find out more about the mysterious Arthera Device. The player must explore several locations before finding the captain",
        "Do not make up actions on behalf of the player, let them decide what to do."
    ],

    "repeat": false,

    "PipelineExecutor": [
        {"PromptRunner": [
            "The player starts out in a marketplace.",
            {"MessageAppender": "Start out by describing the overall scene. Then ask what the player wants to do next."}
            ]
        },
        {"MessageWriter": true},
        {"PipelineExecutor": [
            {"MessageReader": "YOU:"},
            {"PromptRunner": [
                {"ContextMemoryAppender": "summary", "as": "Game Summary"},
                {"ContextMemoryAppender": "locations", "as": "Locations"},
                "Describe what happens next based on the player's response. Always ask what the player wants to do next.",
                {"MessagesLoader": 4}
            ]},
            {"MessageWriter": true}, 
            {"PromptRunner": [
                {"PromptStarter": "You are the memory system for a game agent. You will keep track of the game's progress."},
                {"ContextMemoryAppender": "summary", "as": "Game Summary"},
                {"MessagesLoader": 8},
                {"MessageAppender": "Summarize the last few interactions. Create a concise, bulleted list of what has happened so far in the game. Only include the bulleted list with no introduction or conclusion. Use a simple, active sentence with minimal words to convey the information. Include information from the previous summary for a complete description of the world state."}
            ], "run_every": 4, "append_history": false},
            {"MemoryKeeper": "summary", "replace": true},
            {"PromptRunner": [
                {"PromptStarter": "You are the memory system for a game agent. You will keep track of the game's locations and exits."},
                {"ContextMemoryAppender": "locations", "as": "Locations"},
                {"MessagesLoader": 8},
                {"MessageAppender": "Summarize the location and exit information from the last several interactions. Create a concise, bulleted list of each location and its exits. Only include the bulleted list with no introduction or conclusion. Use a simple, active sentence with minimal words to convey the information. Include information from the previous location information for a complete description of the world."}
            ], "run_every": 4, "append_history": false},
            {"MemoryKeeper": "locations", "replace": true}
        ], "repeat": true}
    ]
}