[
    "Light behaves both as a wave and a particle, a phenomenon known as wave-particle duality.",
    "The speed of light in a vacuum is approximately 299,792 kilometers per second.",
    "Gravity is the force of attraction between two masses.",
    "Isaac Newton formulated the three laws of motion in the 17th century.",
    "Energy cannot be created or destroyed, only transferred or transformed, according to the law of conservation of energy.",
    "The theory of general relativity, proposed by Albert Einstein, describes gravity as a curvature of spacetime.",
    "The Heisenberg uncertainty principle states that you cannot simultaneously know the exact position and momentum of a particle.",
    "In quantum mechanics, particles like electrons can exist in multiple states at once, known as superposition.",
    "The Pauli exclusion principle states that no two fermions (such as electrons) can occupy the same quantum state simultaneously.",
    "A black hole is a region of space where the gravitational pull is so strong that not even light can escape.",
    "Entropy, a measure of disorder in a system, always tends to increase in an isolated system, as stated by the second law of thermodynamics.",
    "Electromagnetism is one of the four fundamental forces, governing the interaction between charged particles.",
    "In a vacuum, all electromagnetic waves travel at the speed of light, regardless of their frequency.",
    "The Planck constant is a fundamental quantity in quantum mechanics, relating the energy of a photon to its frequency.",
    "Nuclear fusion powers the sun, where hydrogen nuclei combine to form helium and release energy.",
    "The Higgs boson, discovered in 2012, is a particle associated with the Higgs field, which gives other particles mass.",
    "Dark matter makes up about 27% of the universe's mass-energy content, though it has never been directly observed.",
    "The strong nuclear force binds protons and neutrons together in the nucleus of an atom.",
    "The weak nuclear force is responsible for processes like beta decay in radioactive atoms.",
    "The photon is the elementary particle that mediates the electromagnetic force.",
    "Einstein's equation E=mc^2 describes the equivalence of mass and energy.",
    "Wave interference occurs when two waves overlap, leading to constructive or destructive interference.",
    "A laser produces a coherent beam of light, where all the photons are in phase and have the same wavelength.",
    "Quantum entanglement is a phenomenon where two or more particles become linked, and the state of one instantly affects the state of the other, regardless of distance.",
    "The Doppler effect explains the change in frequency or wavelength of a wave in relation to an observer moving relative to the source of the wave.",
    "Superconductivity is a state where certain materials conduct electricity without resistance at very low temperatures.",
    "Coulomb's law describes the force between two charged particles.",
    "The speed of sound is approximately 343 meters per second in dry air at room temperature.",
    "The photoelectric effect demonstrates that light can eject electrons from a material, providing evidence for the particle nature of light.",
    "Brownian motion is the random movement of particles suspended in a fluid, resulting from collisions with molecules of the fluid.",
    "The LHC (Large Hadron Collider) is the world's largest and most powerful particle accelerator.",
    "The observable universe is estimated to be about 93 billion light-years in diameter.",
    "Neutrinos are nearly massless, chargeless particles that rarely interact with matter.",
    "Schrödinger's cat is a thought experiment that illustrates the concept of superposition in quantum mechanics.",
    "Friction is the force that opposes the relative motion of two surfaces in contact.",
    "Magnetism is caused by the motion of electric charges, and it can attract or repel materials.",
    "Time dilation, a concept from special relativity, occurs when time passes more slowly for an object moving close to the speed of light compared to one at rest.",
    "A photon has no rest mass and always travels at the speed of light.",
    "The triple point of a substance is the temperature and pressure at which it can exist in all three states of matter: solid, liquid, and gas.",
    "Thermodynamics is the branch of physics that deals with heat, work, and energy.",
    "The kinetic theory of gases describes a gas as a large number of small particles in constant, random motion.",
    "Refraction is the bending of light as it passes from one medium to another.",
    "A supernova is a massive explosion that occurs at the end of a star's life cycle.",
    "The weak equivalence principle states that the trajectory of a freely falling test body is independent of its composition and structure.",
    "Quantum tunneling is the phenomenon where particles can pass through a barrier that they classically shouldn't be able to cross.",
    "Kepler's laws describe the motion of planets around the Sun.",
    "Capacitance is the ability of a system to store an electric charge.",
    "The Joule-Thomson effect describes the temperature change of a gas when it is forced through a valve while kept insulated so that no heat is exchanged with the environment.",
    "The Stefan-Boltzmann law relates the total energy radiated per unit surface area of a black body to the fourth power of its temperature.",
    "Redshift occurs when light from an object moving away from the observer is shifted to longer wavelengths.",
    "Gravitational waves are ripples in spacetime caused by accelerating masses, first directly detected in 2015.",
    "The principle of superposition states that the net response caused by two or more stimuli is the sum of the responses that would have been caused by each stimulus individually.",
    "A soliton is a self-reinforcing solitary wave that maintains its shape while traveling at a constant velocity.",
    "The Hall effect is the production of a voltage difference across an electrical conductor when a magnetic field is applied perpendicular to the current.",
    "Faraday's law of induction states that a changing magnetic field creates an electric field.",
    "The Michelson-Morley experiment provided evidence that the speed of light is constant in all inertial reference frames.",
    "Cherenkov radiation occurs when a charged particle travels through a medium at a speed greater than the speed of light in that medium.",
    "Cosmic microwave background radiation is the thermal radiation left over from the time of recombination in Big Bang cosmology.",
    "Angular momentum is conserved in a closed system, meaning it remains constant unless acted upon by an external torque.",
    "A neutrino oscillation occurs when a neutrino changes its flavor as it propagates through space.",
    "The Casimir effect is a physical force arising from a quantized field between two uncharged, parallel plates.",
    "The principle of least action states that the path taken by a system between two states is the one for which the action is minimized.",
    "Compton scattering involves the increase in wavelength of X-rays or gamma rays when they interact with matter.",
    "A neutron star is the collapsed core of a massive star that has undergone a supernova explosion.",
    "The Bohr model of the atom describes electrons orbiting the nucleus in fixed energy levels.",
    "The Zeeman effect is the splitting of a spectral line into several components in the presence of a static magnetic field.",
    "The Chandrasekhar limit is the maximum mass of a stable white dwarf star, beyond which it will collapse into a neutron star or black hole.",
    "Sonic booms occur when an object travels through the air faster than the speed of sound.",
    "The Carnot cycle is an idealized thermodynamic cycle that defines the maximum possible efficiency of a heat engine.",
    "Diffraction is the bending of waves around obstacles and the spreading of waves past small openings.",
    "An electric dipole consists of two equal and opposite charges separated by a small distance.",
    "The Fermi level is the energy level at which the probability of an electron occupying it is 50% at absolute zero temperature.",
    "The Schwarzschild radius is the radius of the event horizon of a non-rotating black hole.",
    "Photons are the force carriers for the electromagnetic force, mediating interactions between charged particles.",
    "The quark-gluon plasma is a state of matter thought to have existed shortly after the Big Bang, consisting of free quarks and gluons.",
    "The Curie temperature is the temperature above which a ferromagnetic material loses its permanent magnetic properties.",
    "The Poynting vector represents the directional energy flux (the rate of energy transfer per unit area) of an electromagnetic field.",
    "The Lorentz force is the force experienced by a charged particle moving through an electric and magnetic field."
]